[
    {
        "_id": "CS1234",
        "name": "React JS",
        "number": "CS1234",
        "startDate": "2024-01-15",
        "endDate": "2024-05-10",
        "department": "CS",
        "credits": 3,
        "img": "react.png",
        "description": "Full Stack software developer. Dive into the world of React JS, where you'll learn to build user interfaces that change faster than your career goals. Master the art of over-engineering simple websites and confusing future maintainers with unnecessarily complex component hierarchies."
      },
      {
        "_id": "CS4990",
        "name": "Sleep Management",
        "number": "CS4990",
        "startDate": "2024-01-16",
        "endDate": "2024-05-11",
        "department": "CS",
        "credits": 2,
        "img": "sleep.webp",
        "description": "Techniques for atleast 1 hr sleep. Unlock the secrets of achieving a whole hour of sleep. Learn to power nap and how to convince your body that caffeine is a food group. Relevant for Computer Science proffessionals."
      },
      {
        "_id": "CS4991",
        "name": "Sleep Management Recitation",
        "number": "CS4991",
        "startDate": "2024-01-16",
        "endDate": "2024-05-11",
        "department": "CS",
        "credits": 1,
        "img": "sleeplab.jpg",
        "description": "Recitation for CS4990 Sleep Management. Students will practice sleeping with their eyes open during lectures through guided exercises and discussions."
      },
      {
        "_id": "CS0020",
        "name": "Advanced Cooking",
        "number": "CS0020",
        "startDate": "2024-01-17",
        "endDate": "2024-05-12",
        "department": "CS",
        "credits": 3,
        "img": "cooking.png",
        "description": "Cook Frozen Dinners like a Pro. Elevate your microwave skills to gourmet levels. Learn to differentiate between 'freezer burn' and 'extra seasoning'. By the end of this course, you'll be able to prepare a three-course meal using only a vending machine and a coffee maker."
      },
      {
        "_id": "CS0021",
        "name": "Advanced Cooking Lab",
        "number": "CS0021",
        "startDate": "2024-01-17",
        "endDate": "2024-05-12",
        "department": "CS",
        "credits": 1,
        "img": "cookinglab.png",
        "description": "Lab for CS0020 Advanced Cooking. Practice the ancient art of toast scraping and learn to revive week-old pizza. Special focus on optimizing your trans-fat-to-code ratio for maximum productivity during finals."
      },
      {
        "_id": "CS4880",
        "name": "Cannibalizing with ChatGPT",
        "number": "CS4880",
        "startDate": "2024-01-18",
        "endDate": "2024-05-13",
        "department": "CS",
        "credits": 4,
        "img": "chatgpt.jpeg",
        "description": "Cannibalize your future job with AI. Why innovate when you can regurgitate? Learn to outsource your thinking to AI and pass it off as brilliance. Includes lessons on crafting convincing excuses for why your code is eerily similar to Stack Overflow answers."
      },
      {
        "_id": "SC0054",
        "name": "Software Undevelopment",
        "number": "0054SC",
        "startDate": "2024-01-19",
        "endDate": "2024-05-14",
        "department": "SC",
        "credits": 3,
        "img": "software.jpg",
        "description": "Undevelop your brain with this class. Master the art of writing code so convoluted, even you won't understand it tomorrow. Learn to create self-destructing functions, implement 'features' that are indistinguishable from bugs, and write documentation that raises more questions than it answers."
      },
      {
        "_id": "CS3200",
        "name": "Practical Plumbing",
        "number": "CS3200",
        "startDate": "2024-01-20",
        "endDate": "2024-05-15",
        "department": "CS",
        "credits": 3,
        "img": "plumbing.jpeg",
        "description": "Most secure job from AI in the future. Future-proof your career by learning to unclog both pipes and servers. Discover the parallels between debugging code and snake-ing drains. By the end of this course, you'll be able to fix memory leaks in your programs and actual leaks in your bathroom."
      }
]